<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
    <head>
        <title>Département d'informatique - CEGEP de Rosemont - Montréal</title>
        <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
        <link href="./style/style.css" rel="stylesheet" type="text/css">
    </head>

    <body>
        <div id="tout">
            <h1>DEC en techniques de l'informatique</h1>
            <dl>
                <dt onclick="f(0)"><span>
                        420-013-RO. Introduction aux fonctions de travail de l'informatique </span>
                </dt>
                <dd class="descricours" id="desc1">
                    Ce cours permet &agrave; l'&eacute;tudiant d'identifier les diff&eacute;rentes fonctions de travail ainsi que leurs conditions d'exercices. Pour chacune d'elles, l'&eacute;tudiant sera amen&eacute; &agrave; examiner les t&acirc;ches qui y sont reli&eacute;es, en plus d'identifier les habilet&eacute;s et les comportements n&eacute;cessaires &agrave; l'exercice de celles-ci. 
                    L'&eacute;tudiant sera aussi amen&eacute; &agrave; examiner les diff&eacute;rentes lois et r&eacute;glementations portant sur les fonctions de travail du monde de l'informatique. 
                    &Agrave; la fin du cours, l'&eacute;tudiant sera bien outill&eacute; pour cibler son choix professionnel.  
                </dd>
                <dt onclick="f(1)"><span>
                        420-026-RO. Introduction aux concepts de la programmation structur&eacute;e </span>
                </dt>
                <dd class="descricours" id="desc2">
                    Ce premier cours de programmation permet &agrave; l'&eacute;tudiant de s'initier aux techniques de r&eacute;solution de probl&egrave;mes par l'algorithmie. Par la suite, il sera amen&eacute; &agrave; programmer ses solutions dans un environnement de programmation structur&eacute;e. Pour ce faire, il sera initi&eacute; aux diff&eacute;rentes r&egrave;gles et techniques de la programmation structur&eacute;e. 
                    Les concepts de variables, de structures r&eacute;p&eacute;titives, de structures conditionnelles et de modularit&eacute; sont aussi couvertes dans ce cours.  
                </dd>  
                <dt onclick="f(2)"><span>
                        420-035-RO. Introduction aux syst&egrave;mes d'exploitation </span>
                </dt>
                <dd class="descricours" id="desc3">
                    Ce cours permet &agrave; l'&eacute;tudiant de s'initier aux r&ocirc;les et fonctionnalit&eacute;s des syst&egrave;mes d'exploitations. Le syst&egrave;me de fichier et les instructions associ&eacute;es &agrave; la gestion des fichiers et des r&eacute;pertoires y sont couverts. Les techniques et les commandes de gestion de m&eacute;moire en plus des m&eacute;thodes et des outils d'automatisation des t&acirc;ches sont appris par l'&eacute;tudiant. 
                    Finalement, la personnalisation de l'environnement de travail de l'usager est aussi contenue dans ce cours. 
                    L'ensemble de ces notions est couvert dans deux syst&egrave;mes d'exploitation soit un produit de la famille MICROSOFT et le syst&egrave;me LINUX.
                </dd>    
            </dl>
        </div>
        <script>
            //var affiche = 0;
            function f(i) {

                for (var j = 0; j < 3; j++) {
                    var elem = document.getElementsByTagName("dd")[j];
                    elem.style.display = "none";
                }
                var elem = document.getElementsByTagName("dd")[i];
                elem.style.display = "block";
                
                //first display or hide with click
                /*if (affiche == 0) {
                 var elem = document.getElementsByTagName("dd")[i];
                 elem.style.display = "block";
                 affiche = 1;
                 } else {
                 var elem = document.getElementsByTagName("dd")[i];
                 elem.style.display = "none";
                 affiche = 0;
                 }
                 }*/
        
                //second display or hide with click (doesn't work!)
                /*for (var i = 0; i < 3; i++) {
                 document.getElementsByTagName("dt")[i].addEventListener("click", function () {
                 var id = this;
                 alert(id);
                 var elem = document.getElementById(id);
                 //var elem = this;
                 //elem.parentNode.removeChild(elem);
                 //alert(elem);
                 elem.style.display = "none";
                 //alert("heloo");
                 });
                 }*/
            }
        </script>
    </body>
</html>
